Revit 2024 API
MultiReferenceAnnotation.DimensionId Property
 The child dimension owned by this multi-reference annotation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ElementId DimensionId { get; }
Visual Basic
Public ReadOnly Property DimensionId As ElementId
	Get
Visual C++
public:
property ElementId^ DimensionId {
	ElementId^ get ();
}
See Also
MultiReferenceAnnotation Class
Autodesk.Revit.DB Namespace